.site/content/getting-started.md
+++
title = "Getting Started with Digital Gardens"
author = ["James"]
date = 2025-12-09T00:00:00+00:00
draft = false
+++

## What is a Digital Garden? {#what-is-a-digital-garden}

A digital garden is a collection of evolving ideas, unlike a traditional blog:

-   Notes are constantly updated and refined
-   Ideas are interconnected, not chronological
-   Imperfect thoughts are published early
-   Knowledge grows organically over time


## Why Work in Public? {#why-work-in-public}

Working in public means sharing your notes as you write them:

-   Get feedback early and often
-   Build connections with like-minded people
-   Create a knowledge base others can learn from
-   Hold yourself accountable to keep learning


## Key Principles {#key-principles}


### Embrace Imperfection {#embrace-imperfection}

Don't wait for notes to be "ready" - publish drafts, rough ideas, and incomplete thoughts. The value is in the process, not just the final product.


### Link Liberally {#link-liberally}

Connect related ideas using org-id links. These links never break, even when you rename files or reorganize.


### Iterate Continuously {#iterate-continuously}

Return to notes and expand them as you learn more. Digital gardens are living documents, not static posts.


## Next Steps {#next-steps}

-   Create your first note, and link it [here](/problem/#re-evaluation)
-   Experiment with linking between notes
-   Share your digital garden with others

Remember: Start small, iterate often, and enjoy the journey!

A link:
[ID link test](/id-link-test/#title-for-link)
